; domain
;; Adapted from: https://github.com/josej30/Planner-Sat-Constraints
;; We use existential preconditions (exists) to remove as many parameters from the actions as possible

(define (domain logistics)

(:requirements :strips :typing :existential-preconditions) 

(:types  city location thing - object
         package vehicle - thing
         truck airplane - vehicle  
         airport - location)
  
(:predicates  (in-city ?l - location ?c - city)
              (at ?obj - thing ?l - location)
              (in ?p - package ?veh - vehicle))
  
(:action drive
         :parameters    (?t - truck ?from ?to - location)
         :precondition  (and 
                             (at ?t ?from)
                             (exists (?c - city)
                                (and (in-city ?from ?c) (in-city ?to ?c))
                              )
                         )
         :effect        (and (not (at ?t ?from))
                             (at ?t ?to)))

(:action fly
         :parameters    (?a - airplane ?from ?to - airport)
         :precondition  (at ?a ?from)
         :effect        (and (not (at ?a ?from))
                             (at ?a ?to)))

(:action load
         :parameters    (?v - vehicle ?p - package ?l - location)
         :precondition  (and (at ?v ?l)
                             (at ?p ?l))
         :effect        (and (not (at ?p ?l))
                             (in ?p ?v)))

(:action unload
         :parameters    (?v - vehicle ?p - package ?l - location)
         :precondition  (and (at ?v ?l)
                             (in ?p ?v))
         :effect        (and (not (in ?p ?v))
                             (at ?p ?l)))

)

; problem
(define (problem logistics-c4-s2-p3-a5)

(:domain logistics)

(:objects a0 a1 a2 a3 a4 - airplane
          c0 c1 c2 c3 - city
          t0 t1 t2 t3 - truck
          l0-0 l1-0 l2-0 l3-0 - airport
          l0-1 l1-1 l2-1 l3-1 - location
          p0 p1 p2 - package
)

(:init
    (in-city  l0-0 c0)
    (in-city  l0-1 c0)
    (in-city  l1-0 c1)
    (in-city  l1-1 c1)
    (in-city  l2-0 c2)
    (in-city  l2-1 c2)
    (in-city  l3-0 c3)
    (in-city  l3-1 c3)
    (at t0 l0-1)
    (at t1 l1-1)
    (at t2 l2-0)
    (at t3 l3-1)
    (at p0 l0-0)
    (at p1 l3-1)
    (at p2 l2-1)
    (at a0 l0-0)
    (at a1 l2-0)
    (at a2 l3-0)
    (at a3 l2-0)
    (at a4 l3-0)
)

(:goal
    (and
        (at p0 l1-1)
        (at p1 l3-0)
        (at p2 l2-0)
    )
)
)

; plan
1. (drive t0 l0-1 l0-0)
   deleted: (at t0 l0-1)
   added: (at t0 l0-0)
   goals met: 0 of 3
2. (fly a1 l2-0 l0-0)
   deleted: (at a1 l2-0)
   added: (at a1 l0-0)
   goals met: 0 of 3
3. (fly a2 l3-0 l0-0)
   deleted: (at a2 l3-0)
   added: (at a2 l0-0)
   goals met: 0 of 3
4. (fly a3 l2-0 l0-0)
   deleted: (at a3 l2-0)
   added: (at a3 l0-0)
   goals met: 0 of 3
5. (load a0 p0 l0-0)
   deleted: (at p0 l0-0)
   added: (in p0 a0)
   goals met: 0 of 3
6. (drive t0 l0-0 l0-1)
   deleted: (at t0 l0-0)
   added: (at t0 l0-1)
   goals met: 0 of 3
7. (drive t1 l1-1 l1-0)
   deleted: (at t1 l1-1)
   added: (at t1 l1-0)
   goals met: 0 of 3
8. (drive t2 l2-0 l2-1)
   deleted: (at t2 l2-0)
   added: (at t2 l2-1)
   goals met: 0 of 3
9. (fly a0 l0-0 l1-0)
   deleted: (at a0 l0-0)
   added: (at a0 l1-0)
   goals met: 0 of 3
10. (fly a4 l3-0 l2-0)
   deleted: (at a4 l3-0)
   added: (at a4 l2-0)
   goals met: 0 of 3
11. (fly a1 l0-0 l1-0)
   deleted: (at a1 l0-0)
   added: (at a1 l1-0)
   goals met: 0 of 3
12. (fly a2 l0-0 l1-0)
   deleted: (at a2 l0-0)
   added: (at a2 l1-0)
   goals met: 0 of 3
13. (fly a3 l0-0 l1-0)
   deleted: (at a3 l0-0)
   added: (at a3 l1-0)
   goals met: 0 of 3
14. (fly a4 l2-0 l3-0)
   deleted: (at a4 l2-0)
   added: (at a4 l3-0)
   goals met: 0 of 3
15. (unload a0 p0 l1-0)
   deleted: (in p0 a0)
   added: (at p0 l1-0)
   goals met: 0 of 3
16. (fly a0 l1-0 l0-0)
   deleted: (at a0 l1-0)
   added: (at a0 l0-0)
   goals met: 0 of 3
17. (fly a1 l1-0 l0-0)
   deleted: (at a1 l1-0)
   added: (at a1 l0-0)
   goals met: 0 of 3
18. (fly a2 l1-0 l0-0)
   deleted: (at a2 l1-0)
   added: (at a2 l0-0)
   goals met: 0 of 3
19. (fly a3 l1-0 l0-0)
   deleted: (at a3 l1-0)
   added: (at a3 l0-0)
   goals met: 0 of 3
20. (fly a4 l3-0 l0-0)
   deleted: (at a4 l3-0)
   added: (at a4 l0-0)
   goals met: 0 of 3
21. (load t1 p0 l1-0)
   deleted: (at p0 l1-0)
   added: (in p0 t1)
   goals met: 0 of 3
22. (load t2 p2 l2-1)
   deleted: (at p2 l2-1)
   added: (in p2 t2)
   goals met: 0 of 3
23. (load t3 p1 l3-1)
   deleted: (at p1 l3-1)
   added: (in p1 t3)
   goals met: 0 of 3
24. (drive t1 l1-0 l1-1)
   deleted: (at t1 l1-0)
   added: (at t1 l1-1)
   goals met: 0 of 3
25. (drive t2 l2-1 l2-0)
   deleted: (at t2 l2-1)
   added: (at t2 l2-0)
   goals met: 0 of 3
26. (drive t3 l3-1 l3-0)
   deleted: (at t3 l3-1)
   added: (at t3 l3-0)
   goals met: 0 of 3
27. (fly a1 l0-0 l2-0)
   deleted: (at a1 l0-0)
   added: (at a1 l2-0)
   goals met: 0 of 3
28. (unload t1 p0 l1-1)
   deleted: (in p0 t1)
   added: (at p0 l1-1)
   goals met: 1 of 3
29. (unload t2 p2 l2-0)
   deleted: (in p2 t2)
   added: (at p2 l2-0)
   goals met: 2 of 3
30. (unload t3 p1 l3-0)
   deleted: (in p1 t3)
   added: (at p1 l3-0)
   goals met: 3 of 3
